app/controllers/reflections_controller.rb

  def create
    @reflection = Reflection.new(reflection_params)
    # I need this if statemnt in order to actually save the new reflection
    if @reflection.save
---
INSERT INTO "reflections" ("name", "relationship", "thoughts", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "buddy"], ["relationship", "the best nephew"], ["thoughts", "I liked him a lot."], ["created_at", "2018-03-21 16:51:33.571832"], ["updated_at", "2018-03-21 16:51:33.571832"]]

  def index
    @reflections = Reflection.all
---
SELECT "reflections".* FROM "reflections"

  def show
    @reflection = Reflection.find(params[:id])
---
SELECT  "reflections".* FROM "reflections" WHERE "reflections"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def destroy
    @reflection = Reflection.find(params[:id])
    @reflection.destroy
---
SELECT  "reflections".* FROM "reflections" WHERE "reflections"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "reflections" WHERE "reflections"."id" = $1  [["id", 2]]